## 1강

In [1]:
import pandas as pd

In [2]:
data_frame = pd.read_csv('data/friend_list.csv')

In [3]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [5]:
data_frame.tail(2)

    name  age      job
4  Brian   45  manager
5  Chris   25   intern

In [8]:
type(data_frame.name)

pandas.core.series.Series

In [9]:
list_tmp = [1,2,3]

In [10]:
list_tmp

[1, 2, 3]

In [12]:
s1 = pd.core.series.Series([1,2,3])

In [14]:
s2 = pd.core.series.Series(['one', 'two', 'three'])

In [15]:
s1

0    1
1    2
2    3
dtype: int64

In [16]:
s2

0      one
1      two
2    three
dtype: object

pd.DataFrame(data = dict(num=s1, word=s2))

## 2강

In [18]:
!conda list | grep pandas

pandas                    0.24.1           py36h0a44026_0
pandas-datareader         0.7.0                    py36_0

In [19]:
import pandas as pd

In [20]:
df = pd.read_csv('data/friend_list.csv')

In [21]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [23]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [24]:
df = pd.read_csv('data/friend_list.txt')

In [25]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [34]:
df1 = pd.read_csv('data/friend_list_tab.txt', sep = '\t')

In [35]:
df1

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [39]:
df2 = pd.read_csv('data/friend_list_no_head.csv', header = None)

In [40]:
df2

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [44]:
df2.columns = ['name', 'age', 'job']

In [45]:
df2

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [46]:
df3 = pd.read_csv('data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [47]:
df3

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## 3강

In [49]:
import pandas as pd

In [50]:
friend_dict_list = [
    {'name' : 'John', 'age' : 25, 'job':'student'},
    {'name' : 'Nate', 'age' : 30, 'job':'teacher'}
]

In [51]:
friend_dict_list

[{'name': 'John', 'age': 25, 'job': 'student'},
 {'name': 'Nate', 'age': 30, 'job': 'teacher'}]

In [52]:
df = pd.DataFrame(friend_dict_list)

In [53]:
df

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [54]:
df1 = df[['name', 'age', 'job']]

In [55]:
df1

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [57]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [58]:
column_name = ['name', 'age', 'job']

In [1]:
1

1

In [2]:
!conda list | grep plotnine

plotnine                  0.5.1                      py_0    conda-forge

In [3]:
pwd

'/Users/sangkim/Pythonwith/bigdata/pandas_heo'

### 6강 drop row or column

import pandas as pd

In [36]:
friend_dict_list = [
    {'name' : 'John', 'age' : 15, 'job':'student'},
    {'name' : 'Ben', 'age' : 25, 'job':'developer'},
    {'name' : 'Jenny', 'age' : 30, 'job':'teacher'}
]

In [37]:
df = pd.DataFrame(friend_dict_list, columns=['name', 'age', 'job'])

In [8]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [9]:
df = df.drop(df.index[[0,2]])

In [10]:
df

  name  age        job
1  Ben   25  developer

In [23]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [29]:
df = df[df['age'] > 20]

In [30]:
df

    name  age        job
1    Ben   25  developer
2  Jenny   30    teacher

In [33]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [34]:
df  = df.drop('age', axis=1)

In [35]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

In [38]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [39]:
df.drop('age', axis=1, inplace=True)

In [40]:
df

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher

 ### 7강 row, column create, update

In [41]:
import pandas as pd

In [42]:
friend_dict_list = [
    {'name' : 'John', 'age' : 15, 'job':'student'},
    {'name' : 'Ben', 'age' : 25, 'job':'developer'},
    {'name' : 'Jenny', 'age' : 30, 'job':'teacher'}
]

df = pd.DataFrame(friend_dict_list, columns=['name', 'age', 'job'])

In [43]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [44]:
import numpy as np

In [45]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no') # numpy를 이용해서 연봉을 넣어준다

In [46]:
df

    name  age        job salary
0   John   15    student     no
1    Ben   25  developer    yes
2  Jenny   30    teacher    yes

In [69]:
friend_dict_list = [
    {'name' : 'John', 'midterm' : 95, 'final':85},
    {'name' : 'Ben', 'midterm' : 85, 'final':80},
    {'name' : 'Jenny', 'midterm' : 30, 'final':50}
]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

In [70]:
df

    name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     50

In [71]:
df['total'] = df['midterm'] + df['final']

In [72]:
df

    name  midterm  final  total
0   John       95     85    180
1    Ben       85     80    165
2  Jenny       30     50     80

In [73]:
df['avg'] = df['total'] / 2

In [74]:
df

    name  midterm  final  total   avg
0   John       95     85    180  90.0
1    Ben       85     80    165  82.5
2  Jenny       30     50     80  40.0

In [75]:
grades = []
for row in df['avg']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

In [76]:
grades

['A', 'B', 'F']

In [77]:
df['grades'] = grades

In [78]:
df

    name  midterm  final  total   avg grades
0   John       95     85    180  90.0      A
1    Ben       85     80    165  82.5      B
2  Jenny       30     50     80  40.0      F

In [58]:
df.head()

    name  midterm  final  total   avg grades
0   John       95     85    180  90.0      A
1    Ben       85     80    165  82.5      B
2  Jenny       30     50     80  40.0      F

In [79]:
def pass_of_fail(row):
    if row != 'F':
        return 'Pass'
    else:
        return 'Fail'

In [80]:
df

    name  midterm  final  total   avg grades
0   John       95     85    180  90.0      A
1    Ben       85     80    165  82.5      B
2  Jenny       30     50     80  40.0      F

In [81]:
df['grades'] = df['grades'].apply(pass_of_fail) # 원하는 row에 함수를 적용 하는 방법

In [82]:
df

    name  midterm  final  total   avg grades
0   John       95     85    180  90.0   Pass
1    Ben       85     80    165  82.5   Pass
2  Jenny       30     50     80  40.0   Fail

In [67]:
df.grades = df.grades.apply(pass_of_fail)

In [84]:
date_list = [
    {
        'yyyy-mm-dd': '2000-06-27'
    },
    {
        'yyyy-mm-dd': '2007-11-27'
    }
    
]

In [85]:
date_list

[{'yyyy-mm-dd': '2000-06-27'}, {'yyyy-mm-dd': '2007-11-27'}]

In [86]:
df = pd.DataFrame(date_list, columns=['yyyy-mm-dd'])

In [87]:
df

   yyyy-mm-dd
0  2000-06-27
1  2007-11-27

In [88]:
def extract_year(row):
    return row.split('-')[0]

In [91]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [92]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-11-27  2007

In [112]:
#열을 변경하여 추가 하는 방법
friend_dict_list = [
    {'name' : 'John', 'midterm' : 95, 'final':85},
    {'name' : 'jenny', 'midterm' : 85, 'final':80},
    {'name' : 'nate', 'midterm' : 30, 'final':50}
]

df = pd.DataFrame(friend_dict_list, columns=['name', 'midterm', 'final'])

In [95]:
df

    name  midterm  final
0   John       95     85
1    Ben       85     80
2  Jenny       30     50

In [113]:
df2 = pd.DataFrame([
    ['Ben', 50, 80]], columns=['name', 'midterm', 'final'])

In [114]:
df2

  name  midterm  final
0  Ben       50     80

In [115]:
df

    name  midterm  final
0   John       95     85
1  jenny       85     80
2   nate       30     50

In [117]:
df3 = pd.concat([df, df2])

In [118]:
df3

    name  midterm  final
0   John       95     85
1  jenny       85     80
2   nate       30     50
0    Ben       50     80

In [120]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  jenny       85     80
2   nate       30     50
3    Ben       50     80